'use client';

import { Questions } from './container/questions';

const data = [
  'شما مرتب دوستان جدیدی پیدا می‌کنید.',
  'شما از تنهایی لذت می‌برید.',
  'شما به راحتی با دیگران ارتباط برقرار می‌کنید.',
  'شما ترجیح می‌دهید در گروه‌های کوچک باشید.',
  'شما انرژی خود را از تعامل با دیگران دریافت می‌کنید.',
  'شما مرتب دوستان جدیدی پیدا می‌کنید.',
  'شما از تنهایی لذت می‌برید.',
  'شما به راحتی با دیگران ارتباط برقرار می‌کنید.',
  'شما ترجیح می‌دهید در گروه‌های کوچک باشید.',
  'شما انرژی خود را از تعامل با دیگران دریافت می‌کنید.',
  'شما مرتب دوستان جدیدی پیدا می‌کنید.',
  'شما از تنهایی لذت می‌برید.',
  'شما به راحتی با دیگران ارتباط برقرار می‌کنید.',
  'شما ترجیح می‌دهید در گروه‌های کوچک باشید.',
  'شما انرژی خود را از تعامل با دیگران دریافت می‌کنید.',
];

export default function Home() {
  return <Questions data={data} />;
}
