import { Likert } from './_components/Likert';
import { Metadata } from 'next';

export const metadata: Metadata = {
  title: 'تست شخصیت شناسی شینودا بولن',
  description: 'طراحی و توسعه توسط حمید شاهسونی',
};

export default function Home() {
  const data = [
    'من دوست دارم به جدیدی آشنا شوم',
    'خیلی خوب نیستم',
    'سریع میتوانم با دیگران صحبت کنم',
    'من همیشه با دیگران گفت و گو می‌کنم',
    'احساس میکنم باید ناجیی دیگران باشم',
    'من دوست دارم به دیگران کمک کنم',
    'من دوست دارم به دیگران آموزش بدم',
    'من دوست دارم به دیگران پیشنهاد بدم',
    'من دوست دارم به دیگران راهنمایی کنم',
    'من دوست دارم به دیگران تشویق کنم',
    'من دوست دارم به دیگران تبریک بدم',
    'من دوست دارم به دیگران میگم خوشحالم',
    'من دوست دارم به دیگران میگم خوشحالم',
  ];

  return (
    <main className="flex w-full flex-col gap-8 py-5">
      {data.map((item) => (
        <Likert text={item} key={item} />
      ))}
    </main>
  );
}
